Revit 2027 API
StairsWinderStyle Enumeration
 The calculation method for the layout of the winder run steps.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsWinderStyle
Public Enumeration StairsWinderStyle
public enum class StairsWinderStyle
type StairsWinderStyle
Members
Member name | Value | Description
Balanced | 0 |  Symmetrical layout style.
SinglePoint | 2 |  Asymmetrical layout style. Winder style is calculated from a single center point.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace